import React from 'react'
import { Paper } from '@material-ui/core'

export default ({ styles }) =>
    <Paper style={styles.Paper}>
        <h2>शिव पञ्चाक्षर स्तोत्रम् </h2>
        <hr />

        नागेन्द्रहाराय त्रिलोचनाय भस्माङ्गरागाय महेश्वराय।
 <br />
        नित्याय शुद्धाय दिगम्बराय तस्मै नकाराय नम:शिवाय॥1॥

  <br />
        <br />
        मंदाकिनीसलिलचन्दनचर्चिताय नन्दीश्वरप्रमथनाथ महेश्वराय।
 <br />
        मण्दारपुष्पबहुपुष्पसुपूजिताय तस्मै मकाराय नम:शिवाय॥2॥

 <br />
        <br />
        शिवाय गौरीवदनाब्जवृन्दसूर्याय दक्षाध्वरनाशकाय।
 <br />
        श्रीनीलकण्ठाय बृषध्वजाय तस्मै शिकाराय नम:शिवाय॥3॥
 <br />
        <br />

        वसिष्ठकुम्भोद्भवगौतमार्यमुनीन्द्रदेवार्चितशेखराय।
 <br />
        चन्द्रार्कवैश्वानरलोचनाय तस्मै वकाराय नम:शिवाय॥4॥
 <br />
        <br />

        यक्षस्वरूपाय जटाधराय पिनाकहस्ताय सनातनाय।
 <br />
        दिव्याय देवाय दिगम्बराय तस्मै यकाराय नम:शिवाय॥5॥
 <br />
        <br />

        पञ्चाक्षरिमदं पुण्यं य: पठेच्छिवसन्निधौ।
 <br />
        शिवलोकमवाप्नोति शिवेन सह मोदते॥6॥</Paper>