import React from 'react'
import { Paper } from '@material-ui/core'

export default ({ styles }) =>
    <Paper style={styles.Paper}>
        <h2>  ॥ श्रीरुद्राष्टकम् ॥</h2>
        <hr />
        नमामीशमीशान निर्वाणरूपं विभुं व्यापकं ब्रह्मवेदस्वरूपम्।
     <br />
        निजं निर्गुणं निर्विकल्पं निरीहं चिदाकाशमाकाशवासं भजेऽहम्॥१॥
        <br />
        <br />
        निराकारमोंकारमूलं तुरीयं गिरा ज्ञान गोतीतमीशं गिरीशम्।
        <br />
        करालं महाकाल कालं कृपालं गुणागार संसारपारं नतोऽहम्॥२॥
        <br /><br />
        तुषाराद्रि संकाश गौरं गभीरं मनोभूत कोटिप्रभा श्री शरीरम्।
        <br />
        स्फुरन्मौलि कल्लोलिनी चारु गङ्गा लसद्भालबालेन्दु कण्ठे भुजङ्गा॥३॥
        <br /><br />
        चलत्कुण्डलं भ्रू सुनेत्रं विशालं प्रसन्नाननं नीलकण्ठं दयालम्।
        <br />
        मृगाधीशचर्माम्बरं मुण्डमालं प्रियं शंकरं सर्वनाथं भजामि॥४॥
        <br /><br />
        प्रचण्डं प्रकृष्टं प्रगल्भं परेशं अखण्डं अजं भानुकोटिप्रकाशम्।
        <br />
        त्रयः शूल निर्मूलनं शूलपाणिं भजेऽहं भवानीपतिं भावगम्यम्॥५॥
        <br /><br />
        कलातीत कल्याण कल्पान्तकारी सदा सज्जनानन्ददाता पुरारी।
        <br />
        चिदानन्द संदोह मोहापहारी प्रसीद प्रसीद प्रभो मन्मथारी॥६॥
        <br /><br />
        न यावत् उमानाथ पादारविन्दं भजन्तीह लोके परे वा नराणाम्।
        <br />
        न तावत् सुखं शान्ति सन्तापनाशं प्रसीद प्रभो सर्वभूताधिवासम्॥७॥
        <br /><br />
        न जानामि योगं जपं नैव पूजां नतोऽहं सदा सर्वदा शम्भु तुभ्यम्।
        <br />
        जरा जन्म दुःखौघ तातप्यमानं प्रभो पाहि आपन्नमामीश शम्भो॥८॥
        <br /><br />
        रुद्राष्टकमिदं प्रोक्तं विप्रेण हरतोषये।
        <br />
        ये पठन्ति नरा भक्त्या तेषां शम्भुः प्रसीदति॥
        <br /><br />
        ॥ इति श्रीगोस्वामितुलसीदासकृतं श्रीरुद्राष्टकं सम्पूर्णम् ॥
</Paper>